# Brewfile

brew "ansible"
brew "antidote"
brew "dockutil"
brew "eza"
brew "fabric-ai"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "go-task"
brew "infisical/get-cli/infisical"
brew "lazygit"
brew "mas" # Mac App Store command-line interface
brew "mole" # Deep clean and optimize your Mac
brew "node"
brew "nvim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree-sitter"
brew "yt-dlp"
brew "zoxide"


#############
### LSPs  ###
#############
brew "lua-language-server"


#############
### Taps  ###
#############


#############
### Casks ###
#############

# code
# cask "cursor"
# cask "visual-studio-code"
# cask "zed"

# terminal
# cask "kitty"
# cask "iterm2"
cask "ghostty"

# browser
cask "brave-browser"
# cask "google-chrome"
# cask "firefox"

# password manager
cask "1password"
cask "keeweb"

# video
# cask "vlc"

# clipboard manager
cask "maccy"

# calendar
cask "fantastical"

# utility
# cask "hiddenbar"
cask "appcleaner"

# docker
cask "docker"

# vpn
# cask "mullvadvpn"

# bookmark
cask "raindropio"

# file
# cask "dropzone"
# cask "cryptomator"

# pdf
cask "pdf-expert"

# torrent
# cask "transmission"

# fonts
cask "font-monaspace"
cask "font-monaspace-nf"
cask "font-monaspace-var"
cask "font-symbols-only-nerd-font"

# api
# cask "postman"

# notes
cask "obsidian"

# window manager
cask "nikitabobko/tap/aerospace"
